Repository: bitml-lang/bitml-doc
Catalog: source/locales/*/LC_MESSAGES/index.po
Languages: pt_br

source: BitML Tutorial
pt_br: Tutorial BitML

source: Smart contracts
pt_br: Smart Contracts(Contratos Inteligentes)

source: BitML Toolchain
pt_br: Conjunto de Ferramentas da linguagem BitML(Toolchain)

source: |langname| is a domain-specific language for Bitcoin smart contracts, introduced in [CCS18]_. The |langname| toolchain implements:
pt_br: |langname| é uma DSL(domain-specific language) para Smart Contracts do Bitcoin,apresentada em [CCS18]_. O conjunto de ferramentas |langname| implementa as seguintes funcionalidades:

source: an **IDE** for developing BitML contracts, integrated in the DrRacket IDE [RACKET]_;
pt_br: um **IDE** para desenvolvimento de contratos baseados em BitML, integrado dentro do IDE DrRacket [RACKET]_;

source: a **compiler** which translates |langname| contracts into *standard* Bitcoin transaction. The compiler is *computationally sound*, meaning that computational attacks (i.e., at the level of Bitcoin transactions) can be detected at the symbolic level of the BitML semantics;
pt_br: um **compilador** que traduz contratos |langname| em contratos transacionais *padronizados* para Bitcoin. O compilador é *computacionalmente adequado*, que sigfnicaque ataques computacionais (E.X., no nível das transações do Bitcoin) possam ser detectados no nível simbólico da semântica da linguagem BitML;

source: a **model checker** which verifies security properties of BitML contracts, like their *liquidity* (i.e., funds never remain frozen in a contract [POST19]_), and custom LTL properties. The model checker is based on Maude [MAUDE]_.
pt_br: um **verificador de modelo(model checker)** quer verifica as propriedades de segurança dos contratos BitML, como sua *liquidez* (E.X., fundos nunca ficam bloqueados em um contrato [POST19]_), e propriedades LTL(https://en.wikipedia.org/wiki/Linear_temporal_logic) personalizadas. O verificador de modelo(model checker) é baseado no Verificador Maude de Modelos Lógicos LTL(Maude LTL Logical Model Checker) [MAUDE]_.http://maude.cs.illinois.edu/tools/lmc/

source: We made available a `preprint <https://arxiv.org/abs/1905.07639>`_ describing out toolchain, and a short video `demonstration <https://www.youtube.com/watch?v=bxx3bM5Pm6c>`_.
pt_br: Disponibilizamos uma documentação para impressão em `<https://arxiv.org/abs/1905.07639>`_ que descreve nosso conjunto de ferramentas(Toolchain), e um curto vídeo de `demonstração <https://www.youtube.com/watch?v=bxx3bM5Pm6c>`_.

source: The |langname| toolchain is developed by the `Blockchain@Unica group <http://blockchain.unica.it/>`_ of the `University of Cagliari <https://www.unica.it/unica/en/homepage.page>`_. The project is open source, and you are welcome to contribute to its `repositories <https://github.com/bitml-lang>`_.
pt_br: O conjunto de ferramentas(toolchain) |langname| é desenvolvido pelo `grupo Blockchain@Unica <http://blockchain.unica.it/>`_ da `Universidade de Cagliari, em Sardinia, Itália<https://www.unica.it/unica/en/homepage.page>`_. O projeto é Open Source, e você é bem vindo para contribuir para os `repositórios do projeto no Github<https://github.com/bitml-lang>`_.

source: Contents
pt_br: Conteúdo

source: |langname| is intended for research purposes only. Do not use it to create mainnet transactions, or do it at your own risk.
pt_br: NOTA IMPORTANTE: |langname| foi projetada com foco em pesquisa apenas! **Não utilize** para criar transações na mainnet, **ou faça por sua PRÓPRIA CONTA E RISCO!!!!**

source: References
pt_br: Referências:

source: Bartoletti, R. Zunino. **BitML: A Calculus for Bitcoin Smart Contracts**. In *ACM SIGSAC CCS*, 2018. Preprint: https://eprint.iacr.org/2018/122.pdf
pt_br: Bartoletti, R. Zunino. **BitML: A Calculus for Bitcoin Smart Contracts(BitML: Um Cálculo para Smart Contracts em Bitcoin - Inglês)** *ACM SIGSAC CCS*, 2018. Link para impressão: https://eprint.iacr.org/2018/122.pdf

source: Bartoletti, R. Zunino. **Verifying liquidity of Bitcoin contracts**. In *Principles of Security and Trust (POST)*, 2019. Preprint: https://eprint.iacr.org/2018/1125.pdf
pt_br: Bartoletti, R. Zunino. **Verifying liquidity of Bitcoin contracts(VerificANDO liquidez de contratos em Bitcoin)**. Em *Principles of Security and Trust (POST)*, 2019. Link para impressão: https://eprint.iacr.org/2018/1125.pdf
